//
//  VariableMapping.swift
//  상추 - 상권추천서비스
//
//  Created by 안상준 on 3/27/24.
//

import Foundation

struct VariableMapping {
    static let boroughsToGuCode = [
        "종로구": 11110,
        "중구": 11140,
        "용산구": 11170,
        "성동구": 11200,
        "광진구": 11215,
        "동대문구": 11230,
        "성북구": 11290,
        "중랑구": 11260,
        "강북구": 11305,
        "도봉구": 11320,
        "노원구": 11350,
        "은평구": 11380,
        "서대문구": 11410,
        "마포구": 11440,
        "양천구": 11470,
        "강서구": 11500,
        "구로구": 11530,
        "금천구": 11545,
        "영등포구": 11560,
        "동작구": 11590,
        "관악구": 11620,
        "서초구": 11650,
        "강남구": 11680,
        "송파구": 11710,
        "강동구": 11740
    ]

    static let categoryToServiceCode = [
        "한식음식점": "CS100001",
        "중식음식점": "CS100002",
        "일식음식점": "CS100003",
        "양식음식점": "CS100004",
        "제과점": "CS100005",
        "패스트푸드점": "CS100006",
        "치킨전문점": "CS100007",
        "분식전문점": "CS100008",
        "호프_간이주점": "CS100009",
        "커피_음료": "CS100010"
    ]
}
